---
kind: enumMember
id: F:Autodesk.Revit.DB.ExternalDBApplicationResult.Failed
enum: Autodesk.Revit.DB.ExternalDBApplicationResult
source: html/d7873d96-ce3d-a8d1-d1d7-c95b65fd79b8.htm
---
# Autodesk.Revit.DB.ExternalDBApplicationResult.Failed

The external db application was unable to complete its task.